app/controllers/geo_api_controller.rb

SELECT  "geolocations".* FROM "geolocations" WHERE "geolocations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_geolocation
    @geolocation = Geolocation.find(params[:id])

SELECT "geolocations".* FROM "geolocations"
---
  def index
    @geolocations = Geolocation.all

INSERT INTO "geolocations" ("message", "lat", "lng", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "dfdsf"], ["lat", 1.0], ["lng", 1.0], ["created_at", "2018-01-21 16:33:21.961709"], ["updated_at", "2018-01-21 16:33:21.961709"]]
---
  def create
    @geolocation = Geolocation.new(geolocation_get_params)
    respond_to do |format|
      if @geolocation.save

UPDATE "geolocations" SET "message" = ?, "updated_at" = ? WHERE "geolocations"."id" = ?  [["message", "wwww"], ["updated_at", "2018-01-21 16:49:56.346482"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @geolocation.update_attributes(geolocation_get_params)

DELETE FROM "geolocations" WHERE "geolocations"."id" = ?  [["id", 9]]
---
  def destroy
    respond_to do |format|
      if @geolocation.destroy