app/controllers/geolocations_controller.rb

SELECT  "geolocations".* FROM "geolocations" WHERE "geolocations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_geolocation
    @geolocation = Geolocation.find(params[:id])

SELECT "geolocations".* FROM "geolocations"
---
  def index
    @geolocations = Geolocation.all

INSERT INTO "geolocations" ("message", "lat", "lng", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "dgdfgdfgfdg"], ["lat", 2.1], ["lng", 3.5], ["created_at", "2018-01-20 08:49:17.725248"], ["updated_at", "2018-01-20 08:49:17.725248"]]
---
  def create
    @geolocation = Geolocation.new(geolocation_get_params)

    if @geolocation.save

DELETE FROM "geolocations" WHERE "geolocations"."id" = ?  [["id", 2]]
---
  def destroy
    @geolocation.destroy